Revit 2024 API
IFCLevelInfo Methods
The IFCLevelInfo type exposes the following members.
Methods
Name | Description
Create
 Creates an IFCLevelInfo.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBuildingStorey
 Gets the IfcBuildingStorey handle.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLocalPlacement
 Gets the local placement.
GetRelatedElements
 Gets all building elements on this level.
GetRelatedProducts
 Gets all building products on this level.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace